viewer.scene.globe.depthTestAgainstTerrain = true;//默认深度检测（地形）
document.getElementsByClassName("cesium-viewer-toolbar")[0].style = "right:25px;top:105px;width:50px;height:50px";                                  //修改工具栏样式
document.getElementsByClassName("cesium-button cesium-toolbar-button")[0].style = "width:50px;height:50px";                                         //修改工具栏样式
document.getElementsByClassName("cesium-button cesium-toolbar-button")[1].style = "width:50px;height:50px";                                         //修改工具栏样式
document.getElementsByClassName("cesium-baseLayerPicker-selected")[0].style = "width:50px;height:50px";                                             //修改工具栏样式
setTimeout(FlyToChina(), 3000);
function FlyToChina() {
    viewer.camera.flyTo({ destination: new Cesium.Rectangle.fromDegrees(73.66, 3.86, 135.05, 53.55) }, { duration: 3 });//定位中期
};


/*
 * 全局变量
 */
var handler = null;

var tree = layui.tree;
var form = layui.form;
var table = layui.table;
var util = layui.util;
var date = layui.laydate;
var elem = layui.element;

var tipslayer = -1;//全局提示层
var loadlayerindex = null;//全部加载层

var uavprojectauthlayerindex = null;     //项目授权模块
var uavprojectaddlayerindex = null;      //项目（新建）模块
var uavprojectviewlayerindex = null;     //项目（查看）模块
var uavprojecteditlayerindex = null;     //项目（编辑）模块
var selectroutetypelayerindex = null;    //航线（选择）模块
var uavrouteaddlayerindex = null;        //航线（新建）模块
var uavrouteviewlayerindex = null;       //航线（查看）模块
var uavrouteeditlayerindex = null;       //航线（编辑）模块

var headeruserlayerindex = null;//用户模块
var headerselayerindex = null;//设置模块


var uav_project_list_all = [];//航线项目数据（包括项目、模型、路径）

var current_project_id = null;                  //当前项目
var current_project_title = null;               //当前项目标题（用于高亮显示）
var current_model_id = null;                    //当前模型id
var current_project_tile = null;                //当前模型
var current_waypoint_title = null;              //当前航点标题（用于高亮显示）

var current_entities_route = [];//当前路径

var isReloadTree = false;//是否tree重载（默认否）用于处理由于tree重载触发的选中事件


/*
 * 图标
 */
var TAKEOFFICON = '<span style="margin-right:2px;"><img src="../../../Resources/img/uav/takeoff.png" style="width:14px;height:14px;"/></span>';
var LANDINGICON = '<span style="margin-right:2px;"><img src="../../../Resources/img/uav/landing.png" style="width:14px;height:14px;"/></span>';
var TARGETICON = '<span style="margin-right:2px;"><img src="../../../Resources/img/uav/target.png" style="width:14px;height:14px;"/></span>';
var AVOIDICON = '<span style="margin-right:2px;"><img src="../../../Resources/img/uav/avoid.png" style="width:14px;height:14px;"/></span>';
var TARGETAREAICON = '<span style="margin-right:2px;"><img src="../../../Resources/img/uav/targetarea.png" style="width:14px;height:14px;"/></span>';
var MODELICON = '<span style="margin-left:0px;margin-right:2px;"><img src="../../../Resources/img/map/model.png" style="width:14px;height:14px;"/></span>';
var WAYLINECON = '<span style="margin-left:0px;margin-right:2px;"><img src="../../../Resources/img/uav/wayline.png" style="width:14px;height:14px;"/></span>';

/*
 * 默认参数
 */
var takeoffheight = 400;         //(默认值)起飞点高度，单位m
var initialspeed = 8;            //(默认值)初始速度，单位m/s
var routespeed = 8;              //(默认值)航线速度，单位m/s

var avoidheight = 150;           //(默认值)避障点高度，单位m
var landingheight = 100;         //(默认值)降落点高度，单位m

var adjustdistance = 5;         //(默认值)调整距离，单位m
var photodistance = 80;         //(默认值)拍照距离，单位m
var adjustspeed = 1;            //(默认值)调整速度，单位m/s
var hovertime = 3000;           //(默认值)悬停时间，单位ms
var yawangle = 180;             //(默认值)偏航角，单位°  [-180,180]
var pitchangle = 0;             //(默认值)偏航角，单位°    [-90,0]

var gsd = 1;                    //地面分辨率，单位cm
var forwardoverlap = 80;        //航向重叠度，百分比
var sideoverlap = 70;           //旁向重叠度，百分比
var multiangle = false;         //首末航向多角度
var doublegrid = false;         //井字形
var directmodify = false;       //方向修正（计算第二次自定义平面坐标系y正轴点出错导致的方向错误）

var level = true;              //是否水平





//HomeButton
viewer.homeButton.viewModel.command.beforeExecute.addEventListener(function (e) {
    e.cancel = true;

    if (current_entities_route.length > 0) {
        ZoomToEntities(current_entities_route);
    }
    else if (current_project_tile != null) {
        if (current_project_tile.data.MXSJ != undefined && current_project_tile.data.MXSJ != "") {
            viewer.scene.camera.setView(JSON.parse(current_project_tile.data.MXSJ));
        }
        else {
            viewer.zoomTo(current_project_tile);
        }
    }
    else {
        FlyToChina();//定位中国
    }
});


//高亮节点
function MarkNode() {
    //选中节点高亮
    var nodes = document.getElementsByClassName("layui-tree-txt");
    for (var i = 0; i < nodes.length; i++) {
        if ((nodes[i].innerHTML === current_project_title) || (nodes[i].innerHTML === current_waypoint_title)) {
            nodes[i].style.color = "#009688";
            nodes[i].style.fontSize = "15px";
            nodes[i].style.fontWeight = "bold";
        }
        else {
            nodes[i].style.color = "#555555";
            nodes[i].style.fontSize = "14px";
            nodes[i].style.fontWeight = "normal";
        }
    }
};

//高亮并展开当前项目
function MarkCurrentProject() {
    for (var i in uav_project_list_all) {
        if (uav_project_list_all[i].id == current_project_id) {
            uav_project_list_all[i].spread = true;
            current_project_title = uav_project_list_all[i].title;
        }
        else {
            uav_project_list_all[i].spread = false;
        }
    }

    tree.reload('uav-project-list-treeid', { data: uav_project_list_all });
    MarkNode();//高亮当前节点 
};



//关闭指定图层
function CloseLayer(layerindex) {
    if (layerindex != null) {
        layer.close(layerindex);
        layerindex = null;
    }
};
//关闭所有图层
function CloseAllLayer() {
    if (uavprojectauthlayerindex != null) {
        layer.close(uavprojectauthlayerindex);
        uavprojectauthlayerindex = null;
    }

    if (uavprojectaddlayerindex != null) {
        layer.close(uavprojectaddlayerindex);
        uavprojectaddlayerindex = null;
    }
    if (uavprojectviewlayerindex != null) {
        layer.close(uavprojectviewlayerindex);
        uavprojectviewlayerindex = null;
    }
    if (uavprojecteditlayerindex != null) {
        layer.close(uavprojecteditlayerindex);
        uavprojecteditlayerindex = null;
    }

    if (selectroutetypelayerindex != null) {
        layer.close(selectroutetypelayerindex);
        selectroutetypelayerindex = null;
    }

    if (uavrouteaddlayerindex != null) {
        layer.close(uavrouteaddlayerindex);
        uavrouteaddlayerindex = null;
    }
    if (uavrouteviewlayerindex != null) {
        layer.close(uavrouteviewlayerindex);
        uavrouteviewlayerindex = null;
    }
    if (uavrouteeditlayerindex != null) {
        layer.close(uavrouteeditlayerindex);
        uavrouteeditlayerindex = null;
    }

    if (headeruserlayerindex != null) {
        layer.close(headeruserlayerindex);
        headeruserlayerindex = null;
    }

    if (headerselayerindex != null) {
        layer.close(headerselayerindex);
        headerselayerindex = null;
    }

    //TODO
};



////沁水湾
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2q",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.1328864523702, 31.030986137220143, 110.13275222824699, 31.03100800718323, 110.13254364026217, 31.031048183202756, 110.13241436305519, 31.031031142102993, 110.13218419366541, 31.031014068523657, 110.13217578129115, 31.030995139764546, 110.13225348161774, 31.030977633616743, 110.13244902660742, 31.030989767360133, 110.13263675362721, 31.030950563504383, 110.13281358906309, 31.030927568954617, 110.13288222085123, 31.03086894802806, 110.13290998135135, 31.030855438081083, 110.13294072926934, 31.03089280498792, 110.13294192094126, 31.03093596869638, 110.13293756112112, 31.030966828212026,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));

////黄南背1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2w",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.12041206410471, 31.03219481098926, 110.12048291145625, 31.032199017515577, 110.12053632636848, 31.03220881183351, 110.12060547747176, 31.03221810470266, 110.12068484475847, 31.032221703085582, 110.1207406253324, 31.03222307374559, 110.1207519737003, 31.032247859740558, 110.12077041559887, 31.032295156533188, 110.12075993839774, 31.032317724986893, 110.120703190144, 31.032308698811306, 110.1205706183124, 31.03230487782709, 110.12041575773621, 31.03228054466124, 110.12029108932255, 31.03226127971839, 110.12019318506464, 31.03226546507786, 110.12010671623925, 31.032246109271032, 110.12007102092858, 31.032247381290425, 110.12001951402539, 31.03223020951487, 110.12009652706482, 31.03221732192888, 110.1201153047521, 31.032212113582673, 110.1201463496537, 31.032199572913548, 110.12022089445264, 31.032209589406474, 110.12031722713078, 31.032208949500436, 110.12037983323027, 31.03221286276644,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////黄南背2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2e",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.11764819449999, 31.03238623996447, 110.11762182680347, 31.032383197651217, 110.11757525024434, 31.032408668270907, 110.11751998742346, 31.03239730857322, 110.11742988815996, 31.032425281978316, 110.11735362167012, 31.032391731327053, 110.11727705354379, 31.032359846241462, 110.11726279932702, 31.03235092985518, 110.117246483473, 31.032350212808048, 110.1172483968121, 31.03235174547205,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));

////下后山1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2r",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([

//            110.11593899943603, 31.031992158152743, 110.11611644671953, 31.032016425992424, 110.11628030132711, 31.032016107587303, 110.11623035801014, 31.03214265432698, 110.11605863746145, 31.03220896443918, 110.11576399048701, 31.032101307294308, 110.11556120887956, 31.032034503012337, 110.11551519201392, 31.031954867094097, 110.11554638412595, 31.031913305656545, 110.11573512788549, 31.03195455185137, 110.11588860202407, 31.031948369884397,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////下后山2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2t",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([

//            110.11475072491285, 31.03169909508877, 110.11497467594357, 31.031732155633932, 110.11510625999209, 31.031742513972695, 110.11512831795761, 31.0317929523078, 110.11516054298191, 31.031932700276144, 110.11514484909604, 31.031941705537967, 110.11488413358535, 31.031983664330035, 110.11467967299124, 31.031938102045014, 110.11438496327311, 31.031909987833654, 110.11398356076222, 31.031877475867667, 110.11378898529148, 31.0318847789463, 110.11358175106808, 31.03190217072419, 110.11350183621786, 31.031932160614364, 110.11351945900921, 31.031809691197818, 110.1135608113594, 31.031710280243658, 110.11365303387845, 31.03167383269621, 110.11383823086148, 31.031665877988384, 110.11420203606042, 31.03170518298576, 110.11454961668869, 31.031745684198125,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////下后山3
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2y",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.11292570066945, 31.031465257598487, 110.11241025179014, 31.03133966597051, 110.1118636542585, 31.03116445755101, 110.11165262978957, 31.03097113026539, 110.11182163971557, 31.030748425092682, 110.11224288126098, 31.03083121307347, 110.1128884498645, 31.030991524260646, 110.11304507350997, 31.03097999576373, 110.11320446359028, 31.031006528438212, 110.11309562609395, 31.031279276679463, 110.11306944384998, 31.031343708283444, 110.11301878085652, 31.031369011352815,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////史家嘴1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2i",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.10166027683117, 31.02883461411733, 110.10166326392321, 31.02883569538013, 110.1014876827486, 31.028810428008647, 110.10136056988277, 31.02879733077289, 110.10131981271684, 31.028789566992614, 110.10124227154802, 31.028780032173437, 110.10118778849045, 31.02875211393727, 110.10129256710051, 31.028729373068508, 110.10132492288315, 31.028706596650927, 110.10141758801508, 31.028712387621297, 110.10147916362007, 31.028721019904037, 110.10156388247002, 31.02875264369529, 110.10161902621789, 31.028742568523644, 110.10164004112657, 31.02877333803675, 110.10165575810684, 31.02879786452446,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////史家嘴2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2u",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.10081197340004, 31.02831162662027, 110.10072953345966, 31.0282978346697, 110.10068099623595, 31.028275101446713, 110.10073021230136, 31.02821664341564, 110.10079394798325, 31.02820285442044, 110.10082328988877, 31.028256453232167, 110.10084206204047, 31.028280661300048, 110.10083573570077, 31.028312849361285, 110.10083040021243, 31.02830050349599,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////果园场
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2p",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.08916815604658, 31.025963498108, 110.08914760766697, 31.025971270558454, 110.08913558226284, 31.025926715884403, 110.08912528639476, 31.02590963607278, 110.08908903977378, 31.025885246104952, 110.08906625342401, 31.025870603233145, 110.0890509133685, 31.025848734355723, 110.08899792932608, 31.025868240006655, 110.08897565449683, 31.0258950517863, 110.08895743776988, 31.025888997638553, 110.08892907616041, 31.025922574455603, 110.08878805475712, 31.02583307792098, 110.08873529744402, 31.025825522995035, 110.08870227260495, 31.025799755976266, 110.08869560822734, 31.025828063327015, 110.08871059153117, 31.025897127710863, 110.08886990146969, 31.0259481910687, 110.08898870936962, 31.02598173947796,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////南山内1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2a",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.08251655075463, 31.02335890861678, 110.08257776318077, 31.023368677337338, 110.08262649840084, 31.023357481901765, 110.08261040616314, 31.023310771467088, 110.08261252311424, 31.023239884680393, 110.0825969922262, 31.023205418896154, 110.0825710281832, 31.023165260130646, 110.08252248642178, 31.023158450931625, 110.08245354092777, 31.02314089225558, 110.08242571371665, 31.02314067745193, 110.0823860051611, 31.023176647067213, 110.08233522269977, 31.02317696750394, 110.08235285080583, 31.023187243620843, 110.08236412242096, 31.0232053614446, 110.08239250949204, 31.023216924746805, 110.08242566836131, 31.023242339888004, 110.08245462314336, 31.02323941050233, 110.08249759602474, 31.02338115263982,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////南山内2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2s",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.08126382800049, 31.02410399698763, 110.08125939711034, 31.02412165032841, 110.0811764151766, 31.024157630811086, 110.08117270726943, 31.024136942351753, 110.0811757914505, 31.02412396649847, 110.08117525197329, 31.024112321393446, 110.08117423012271, 31.024107233233863, 110.0811624208836, 31.024095408726733, 110.08113822600184, 31.024096404690404, 110.08113178761947, 31.024097969087208, 110.08113381402691, 31.02408619445558, 110.08118210510811, 31.024052335770143, 110.08121199579679, 31.024049131088734, 110.08122792746728, 31.02405266157189, 110.08123408973721, 31.024065726925016, 110.08123478515029, 31.02406799211958, 110.08123855306691, 31.024073314974608, 110.08124160916958, 31.024074859055492, 110.08126053853812, 31.02407651492278, 110.08125839169966, 31.024085601423394,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));



////南山内3
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2d",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.08212964498033, 31.02378420827634, 110.08210823410288, 31.02379217241101, 110.08206254459715, 31.023789567515283, 110.0820261126446, 31.023804813633806, 110.0819490380992, 31.023779189411076, 110.0819090724587, 31.02379449489014, 110.08190673060851, 31.023797393401924, 110.08193486101531, 31.023812529153876, 110.0819635831232, 31.023751691742795, 110.08203253969184, 31.023711318613664, 110.0820664867625, 31.02364491916239, 110.08210555237713, 31.023676347247367, 110.08210955103145, 31.023717789629224, 110.08213605085083, 31.023753946892153, 110.08212648064544, 31.023768203510787,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////南山内4
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2f",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.08027862472723, 31.02426630943572, 110.08026595780423, 31.024276885956517, 110.08025253129126, 31.024278182357946, 110.08025257832695, 31.024309044040574, 110.08023947249218, 31.024333609540456, 110.08018730026026, 31.024323661146862, 110.08014901867413, 31.024330831142926, 110.0801524605729, 31.024335598625143, 110.08016378710121, 31.024328906779257, 110.08017493176634, 31.024308521511482, 110.08018623487413, 31.024284307078208, 110.08019705133432, 31.02426251154928, 110.08022051864084, 31.024245418826695, 110.08024201488173, 31.02422869692692, 110.08024827902548, 31.024235358380075, 110.08025579130323, 31.02424290635474,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2g",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07471075466398, 31.02321107713712, 110.07464243597126, 31.02320794574725, 110.07457356330517, 31.023198518056688, 110.07453663607309, 31.023193222176666, 110.07454512285098, 31.02317859975585, 110.07455482171913, 31.023159094320736, 110.07456631182514, 31.02314319234623, 110.07457470010701, 31.023141939784388, 110.07455583626896, 31.023112157911214, 110.07458613814235, 31.02311510009621, 110.07463494139107, 31.02311211676427, 110.07469165757595, 31.02314162084924, 110.07471223098254, 31.023143932545295, 110.07470907009969, 31.023168114651934, 110.07470526041871, 31.02319319483149, 110.07470225625966, 31.02320026938553,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2h",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07396175245628, 31.02311380527042, 110.07388666347158, 31.023136520367334, 110.07388186274893, 31.023095015546936, 110.07390918835202, 31.02307450729005, 110.07397533939898, 31.02303096424208, 110.0739771394398, 31.02295024755422, 110.07401382111115, 31.022881712704464, 110.07401513805705, 31.022850790483346, 110.0740747318087, 31.022840271519094, 110.07418372929267, 31.022850935494628, 110.0743074595755, 31.022844358231787, 110.074367704016, 31.022840755340855, 110.07430529529815, 31.0228549512504, 110.0742852479737, 31.022886219065658, 110.07422144997471, 31.022912140071945, 110.07419328716826, 31.022986885492827, 110.07407746988329, 31.023087346264735, 110.07399444968738, 31.023085643935058,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩3
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2j",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07375067452948, 31.023205635050207, 110.07367597006004, 31.023232066713156, 110.07355999298339, 31.02320501380014, 110.07357280783148, 31.023159176842682, 110.07357330519446, 31.023123277244537, 110.07359553082513, 31.023041940848398, 110.0736394185473, 31.023012979155126, 110.07363169605877, 31.02298543922833, 110.07363280834983, 31.0229416686522, 110.07374258515038, 31.02293409473365, 110.07380440974251, 31.022969929173346, 110.07388407850317, 31.02293401519944, 110.07390951053755, 31.0229417355319, 110.07385137415841, 31.02303750090761, 110.07384169336075, 31.023064463186405, 110.07382927479536, 31.023090129877538, 110.07379872158182, 31.023133870516023,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩4
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2k",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07352539845957, 31.02321729355277, 110.07348801087839, 31.023234839145772, 110.07334556499906, 31.02321689350518, 110.07326918170943, 31.023183507178953, 110.07325351706164, 31.023183413399973, 110.07323159027344, 31.023168669075183, 110.07315581665905, 31.023120406809685, 110.07311324216278, 31.02304935419228, 110.07311249058323, 31.022998181849633, 110.07310616252249, 31.02296822670865, 110.07316695650977, 31.022969228219406, 110.07326093778366, 31.022963848318998, 110.07337229743136, 31.023029499085933, 110.07349038406973, 31.022999906994972, 110.07353861883432, 31.02299983457805, 110.07355685779062, 31.02301082683069, 110.07356013448135, 31.02301576046583, 110.07356252064635, 31.023044111505744, 110.07356195754828, 31.02311237729692, 110.07355727041916, 31.023116338193084, 110.07354659769412, 31.023139037623174, 110.07354861597382, 31.023162397781505, 110.07354556087452, 31.023179467526862, 110.07353618427815, 31.023190402127494,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩5
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2l",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07323794589136, 31.02319601706343, 110.07318168742341, 31.023223707966626, 110.07312812439527, 31.02324362330287, 110.07305747322624, 31.023249069468946, 110.07300521424796, 31.02324768110129, 110.07293548343557, 31.023211091353517, 110.0729042827021, 31.023194916412393, 110.07288963382346, 31.02317546923207, 110.07288421609181, 31.02318487284399, 110.07288771417376, 31.023181631723755, 110.07287881372125, 31.023148635159032, 110.07287715185366, 31.023141632697637, 110.07287070622692, 31.023135506685296, 110.07287475825986, 31.02313049937407, 110.0728839982474, 31.02311206326756, 110.07287812931193, 31.02305340952696, 110.07290022720262, 31.022962928989998, 110.07294542698588, 31.022927141332236, 110.07296290303645, 31.02293428583663, 110.07300045458557, 31.022950807794356, 110.07306901612168, 31.022969634291382, 110.07306068741369, 31.022974652010816, 110.0730716126953, 31.022990427644377, 110.07306515892328, 31.02299705502888, 110.07307250465712, 31.02300828957398, 110.07307436190405, 31.02302354872514, 110.07308225478475, 31.02305169740829, 110.07310655205333, 31.02309642812838, 110.07318403813147, 31.023168030406815, 110.07321920869175, 31.023186969385925, 110.07323387872037, 31.023190383546012,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////曲子滩6
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2z",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.07259826075055, 31.02311647380121, 110.07256885277036, 31.023135314842264, 110.07252160186061, 31.02313886210454, 110.07247290097361, 31.023137491865242, 110.0723225021018, 31.023102291498134, 110.07228594144888, 31.023132144137282, 110.07222861383379, 31.023146678900098, 110.07218128513529, 31.023160587896616, 110.07199002126862, 31.023177038074213, 110.07176465366445, 31.02319712772073, 110.0715181646351, 31.023225079841918, 110.07130954632262, 31.023195147664214, 110.07111864426838, 31.023138667928617, 110.07096005607515, 31.023102398539084, 110.07081758882023, 31.02309342385549, 110.07075311696957, 31.02310135242158, 110.0707152575318, 31.02309911731656, 110.07070438466631, 31.023117189070607, 110.07066894212858, 31.023155514384644, 110.07059236510639, 31.023162442752895, 110.07046151610086, 31.02315504666413, 110.07046694048778, 31.023122598287266, 110.07046913437405, 31.023060487182907, 110.07053340279296, 31.02306807239465, 110.07056635626996, 31.023042105266473, 110.07067220396169, 31.023015627549256, 110.07068175571811, 31.02301484065826, 110.07076263692889, 31.02303740213558, 110.07081555272504, 31.023027279319155, 110.07089700248598, 31.023042375867046, 110.0709532731761, 31.023043883751086, 110.07099482255016, 31.023037358283446, 110.07111846519162, 31.02302567250912, 110.07123724335635, 31.023019736441796, 110.07149153329054, 31.02304715383141, 110.07176745312215, 31.023011899383004, 110.07213798007795, 31.023000853305845, 110.0724059299685, 31.02292485592037, 110.07244145635634, 31.022914424100733, 110.0725140084373, 31.022918237431725, 110.07257497003931, 31.022893384693255, 110.07262607172932, 31.022880329906524, 110.07269072388524, 31.02287145232455, 110.07270862666441, 31.022867614282227, 110.07276043578679, 31.02287198853527, 110.07274204658425, 31.022891277863746, 110.07271651559056, 31.022970690923035, 110.0727074793835, 31.022982666555546, 110.07268582396378, 31.02304200876345, 110.07266739323691, 31.023073433522686, 110.07266184422811, 31.02306875863945, 110.0726388002799, 31.023082451614876, 110.07261353768958, 31.023103277116384,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子1
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2x",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06007523225574, 31.022083775864665, 110.05998051298702, 31.022069553533125, 110.0597108025852, 31.022050812002593, 110.05955008037523, 31.022057807125954, 110.05955825371863, 31.02206196834473, 110.05957722807416, 31.02204816169102, 110.0596139144838, 31.02203859340976, 110.05963919589524, 31.022038396640202, 110.0597407152915, 31.02204798814566, 110.0598189179811, 31.022021235574538, 110.05987716375083, 31.02201726416545, 110.05998427950033, 31.022055575784382, 110.06002488866758, 31.022045972963394, 110.06005940332516, 31.02206514643102,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子2
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2c",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06932394614991, 31.022672165692992, 110.06928465290382, 31.022666741340135, 110.06926889949352, 31.022662243914503, 110.06925048391662, 31.02265312616657, 110.06923418300357, 31.022648709030467, 110.06924795544167, 31.022656789054082, 110.06924213989808, 31.022658097190156, 110.06921750904569, 31.022662164369663, 110.06918615691275, 31.022645344727835, 110.06917448933696, 31.022634595904254, 110.06919446291008, 31.022646809467624, 110.06918828983662, 31.022643979400307, 110.06922166455891, 31.02265573382126, 110.06928044965665, 31.022647827453742,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子3
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2v",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06897791196862, 31.02256936424149, 110.0689480350275, 31.022558491612305, 110.06890057112162, 31.022535690640353, 110.06887761889479, 31.022536291791383, 110.06887659667451, 31.02252572757925, 110.068873886089, 31.02252385038136, 110.06887034733337, 31.022519014084725, 110.06886434928884, 31.02250745948109, 110.0688641582816, 31.022495386007208, 110.06886599858329, 31.022490031252214, 110.06890909735107, 31.0224927071624, 110.06897195462187, 31.022510982511474, 110.0689767132527, 31.022527231077568, 110.06897567963583, 31.022546861381848, 110.06898589392262, 31.02254517171216, 110.06898654575684, 31.02255040559133, 110.068990108518, 31.022562351527995,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子4
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2b",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06832787904315, 31.02258560378539, 110.06834642605472, 31.022582264729543, 110.06836187419526, 31.022570772806127, 110.06836385736881, 31.02256941998316, 110.06837260420599, 31.022559967132675, 110.06838885300438, 31.022545958325416, 110.06839107337998, 31.022538267956726, 110.06837191191656, 31.022493383900326, 110.06833740983353, 31.022479011168603, 110.06831231865273, 31.02248165236902, 110.06829023501014, 31.022481646137063, 110.0682555729837, 31.022489001579615, 110.06820029119861, 31.022485434238696, 110.06820891526, 31.02249190432917, 110.06823236904702, 31.022503430679784, 110.06823299846526, 31.02251630091572, 110.06824118810052, 31.022523723278955, 110.06826790429818, 31.02254675625217, 110.06827755937908, 31.022546905161953, 110.06828907054563, 31.02255646100669, 110.06830303487705, 31.022564422803132, 110.06831431007653, 31.022569065483623, 110.06831960710383, 31.022579190282784,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子5
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2n",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06788430332236, 31.022662945125457, 110.06761207242626, 31.022633475201708, 110.06761314370372, 31.022629860455584, 110.06763211165759, 31.022589288290735, 110.06764388901358, 31.02256467137072, 110.06764527869528, 31.022568404534617, 110.06767310241459, 31.022541834601174, 110.0676915561564, 31.022531964289996, 110.06771812050626, 31.02252904798857, 110.06779062183665, 31.02252835387289, 110.06786214367527, 31.022529758657495, 110.06790683476443, 31.022527058955852, 110.06790621585525, 31.022539501379153, 110.06790245063719, 31.022567804381982, 110.06789790855365, 31.022598544899946, 110.06788745056096, 31.022638107300164,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子6
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2m",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06439021944571, 31.021778115464006, 110.06440188854349, 31.02175914144094, 110.06438855682536, 31.021748749432994, 110.06437465565489, 31.021736337693394, 110.06438405318038, 31.021734312789718, 110.06438349652794, 31.02170937369283, 110.0643983304885, 31.0216950911775, 110.06439526843073, 31.02169555188088, 110.06437036072744, 31.02169140423836, 110.06434248862669, 31.02169345929294, 110.0643209002869, 31.02169965365765, 110.06430119018447, 31.021734846564396, 110.06428847018155, 31.02173480250532, 110.06428615052303, 31.02173895186262, 110.0642850368906, 31.02178895380554, 110.06429011082724, 31.021794605714177, 110.06429193005229, 31.0218013664743, 110.06429063878255, 31.02180132690428, 110.06429508370022, 31.02180902802897, 110.06430517898865, 31.021811622863634, 110.0643324984751, 31.02181002451518,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子7
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2qa",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06318992885417, 31.022380704214303, 110.06309012046314, 31.02242864508757, 110.06300021642662, 31.022445639302106, 110.06301166663474, 31.022443556916162, 110.06302672056437, 31.022407309173335, 110.06304364892118, 31.02239182709923, 110.06308468600557, 31.02238130359742, 110.06309220762382, 31.022370806508643, 110.06313278358903, 31.0223462721547, 110.06317413226198, 31.022336858845616, 110.06323660119729, 31.02233327180306, 110.06326396359022, 31.02231652986742, 110.0632665807672, 31.022321983236683, 110.06326109416287, 31.022330489755397, 110.06325980728985, 31.022346848469315, 110.06323829074739, 31.022341601959532, 110.06322971042049, 31.02235672537157, 110.06320702323774, 31.022366324408832,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子8
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2qw",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06296499236768, 31.022468766083087, 110.06281638883988, 31.02252756339466, 110.06274830515267, 31.02251779957998, 110.0627607294113, 31.02246307871575, 110.06276855372839, 31.022418270712706, 110.06277563413266, 31.0224410612834, 110.0627892219906, 31.022433014408676, 110.06292312035066, 31.022382890518795, 110.0629897006815, 31.02237799218149, 110.06298977625798, 31.022399116065277, 110.0629836571755, 31.022415020746955, 110.06297893745554, 31.022428285509278, 110.0629703119093, 31.022445617005207,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子9
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2er",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06106770995088, 31.02227428782183, 110.06101850098077, 31.022264028250476, 110.06095199943164, 31.022259275583465, 110.06092575762867, 31.02226083013732, 110.0609140922912, 31.02227507336065, 110.0609552141829, 31.02229698631639, 110.06102792749951, 31.022320802449688, 110.06105132240019, 31.022314388387468, 110.06106523298126, 31.022299814557048, 110.0610674280725, 31.022295021514584,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));
////青岩子10
//viewer.entities.add(new Cesium.Entity({
//    id: "temp2rf",
//    polyline: {
//        positions: Cesium.Cartesian3.fromDegreesArray([
//            110.06036396521571, 31.022319997505978, 110.06047222011466, 31.02245817827694, 110.06057581386231, 31.022488200734802, 110.0606157415636, 31.02250331446992, 110.0606534126325, 31.022509278112835, 110.06067478502041, 31.022510004847742, 110.0606733806479, 31.022458531168958, 110.06067076447249, 31.022396018395916, 110.0606793279953, 31.022353697628667, 110.06068918321685, 31.022315603516866, 110.06067722336772, 31.022290054627177, 110.06066884419391, 31.02224276098916, 110.0606640030539, 31.0222210811433, 110.06066171703895, 31.0222146227299, 110.06062427720774, 31.022201402055234, 110.06050611767988, 31.02215572807295, 110.06049669626765, 31.022149127329044, 110.06045052184389, 31.022134962123843, 110.06045857620543, 31.022141637308604, 110.06044971823945, 31.022180394775255, 110.06043995304569, 31.022206076924245, 110.06038350007817, 31.022271082813077, 110.06038234109862, 31.022299485652862,
//        ]),
//        width: 2,
//        arcType: Cesium.ArcType.RHUMB,
//        material: Cesium.Color.AQUA,
//        show: true,
//        clampToGround: true,
//        classificationType: Cesium.ClassificationType.BOTH,
//    },
//}));


viewer.entities.add(new Cesium.Entity({
    id: "temp2rf",
    polyline: {
        positions: Cesium.Cartesian3.fromDegreesArray([
            106.75442587, 30.05315742,
            106.75869997, 30.05802362,
            106.76062167, 30.05798694,
            106.76058034, 30.05700305,
            106.76058134, 30.05689445,
            106.76058452, 30.05678589,
            106.76058988, 30.05667738,
            106.76059744, 30.05656898,
            106.76060718, 30.05646071,
            106.7606191, 30.0563526,
            106.76063319, 30.05624469,
            106.76064946, 30.05613701,
            106.7606679, 30.05602959,
            106.7606885, 30.05592246,
            106.76071126, 30.05581567,
            106.76073617, 30.05570924,
            106.76076322, 30.0556032,
            106.7607924, 30.05549758,
            106.76082371, 30.05539242,
            106.76085713, 30.05528775,
            106.76089266, 30.05518361,
            106.76093028, 30.05508002,
            106.76096999, 30.05497701,
            106.76101176, 30.05487462,
            106.7610556, 30.05477287,
            106.76110148, 30.05467181,
            106.76113573, 30.05459955,
            106.76113573, 30.05459955,
            106.76138066, 30.05409083,
            106.75808604, 30.04967891,
            106.75805452, 30.04962947,
            106.758022, 30.04958052,
            106.75798851, 30.04953206,
            106.75795404, 30.04948411,
            106.75791862, 30.04943669,
            106.75788224, 30.04938982,
            106.75784493, 30.0493435,
            106.75780668, 30.04929775,
            106.75776753, 30.04925259,
            106.75772746, 30.04920802,
            106.75768651, 30.04916407,
            106.75764467, 30.04912074,
            106.75760197, 30.04907805,
            106.75755842, 30.04903602,
            106.75751403, 30.04899465,
            106.7574688, 30.04895395,
            106.75742277, 30.04891394,
            106.75737594, 30.04887464,
            106.75732832, 30.04883605,
            106.75727993, 30.04879819,
            106.75723079, 30.04876106,
            106.7571809, 30.04872468,
            106.7571303, 30.04868906,
            106.75707898, 30.04865421,
            106.75702696, 30.04862014,
            106.75697427, 30.04858686,
            106.75692092, 30.04855438,
            106.75686692, 30.04852272,
            106.75681229, 30.04849187,
            106.75675705, 30.04846186,
            106.75670121, 30.04843269,
            106.75664479, 30.04840436,
            106.75658781, 30.04837689,
            106.75653029, 30.04835029,
            106.75647223, 30.04832456,
            106.75641367, 30.04829970999999,
            106.75635462, 30.04827575,
            106.7562951, 30.04825268,
            106.75623512, 30.04823052,
            106.7561747, 30.04820927,
            106.75611386, 30.04818894,
            106.75605262, 30.04816952,
            106.75599101, 30.04815104,
            106.75592902, 30.04813349,
            106.7558667, 30.04811687999999,
            106.75580405, 30.04810122,
            106.75574109, 30.0480865,
            106.75567785, 30.04807273999999,
            106.75561434, 30.04805994,
            106.75555058, 30.0480481,
            106.7554866, 30.04803722,
            106.7554224, 30.04802731,
            106.75535802, 30.04801838,
            106.75529346, 30.04801042,
            106.75522876, 30.04800343,
            106.75516392, 30.04799743,
            106.75509898, 30.04799241,
            106.75503394, 30.04798836,
            106.75496883, 30.04798531,
            106.75490367, 30.04798324,
            106.75483848, 30.04798215,
            106.75477328, 30.04798205,
            106.75470809, 30.04798293,
            106.75466635, 30.04798401,
            106.75466635, 30.04798401,
            106.7546615, 30.04798418,
            106.7546615, 30.04798418,
            106.75464842, 30.04798464,
            106.75464842, 30.04798464,
            106.75458292, 30.04798755,
            106.75457132, 30.04798817,
            106.75457132, 30.04798817,
            106.75450541, 30.04799228,
            106.75449525, 30.04799301,
            106.75449525, 30.04799301,
            106.75442889, 30.04799832,
            106.75442018, 30.04799909,
            106.75442018, 30.04799909,
            106.75435336, 30.0480056,
            106.75434612, 30.04800637,
            106.75434612, 30.04800637,
            106.75427885, 30.04801407,
            106.7542731, 30.04801478,
            106.7542731, 30.04801478,
            106.75420537, 30.04802367,
            106.75420113, 30.04802426,
            106.75420113, 30.04802426,
            106.75413295, 30.04803434,
            106.75413024, 30.04803476,
            106.75413024, 30.04803476,
            106.75406158, 30.04804603,
            106.75406043, 30.04804623,
            106.75406043, 30.04804623,
            106.75399171, 30.04805860999999,
            106.75399171, 30.04805860999999,
            106.7539241, 30.04807185,
            106.7539241, 30.04807185,
            106.7538576, 30.04808589,
            106.7538576, 30.04808589,
            106.75379221, 30.04810068,
            106.75379221, 30.04810068,
            106.75372795, 30.04811618,
            106.75372795, 30.04811618,
            106.7536648, 30.04813233,
            106.7536648, 30.04813233,
            106.75360277, 30.04814908,
            106.75360277, 30.04814908,
            106.75354186, 30.0481664,
            106.75354186, 30.0481664,
            106.75348207, 30.04818422,
            106.75348207, 30.04818422,
            106.75342339, 30.04820252,
            106.75342339, 30.04820252,
            106.75336581, 30.04822124,
            106.75336581, 30.04822124,
            106.75330933, 30.04824034,
            106.75330933, 30.04824034,
            106.7532816, 30.04824999,
            106.7532816, 30.04824999,
            106.74874979, 30.05112338,
            106.75070357, 30.05470943,
            106.75442587, 30.05315742,
            106.75442587, 30.05315742,
        ]),
        width: 2,
        arcType: Cesium.ArcType.RHUMB,
        material: Cesium.Color.AQUA,
        show: true,
        clampToGround: true,
        classificationType: Cesium.ClassificationType.BOTH,
    },
}));